# GetMarkersAndTextSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..GetMarkersAndTextSettings Method
AnalysisDisplayStyle Class See Also
---
Get markers and text settings object from the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayMarkersAndTextSettings GetMarkersAndTextSettings()
```

Visual Basic
---
```text
Public Function GetMarkersAndTextSettings As AnalysisDisplayMarkersAndTextSettings
```

Visual C++
---
```text
public:
AnalysisDisplayMarkersAndTextSettings^ GetMarkersAndTextSettings()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | markers and text settings were not created with the object. |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace